DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvSPI.c
/*---------------------------------------------------------------------------------------------------------*/
/*                                                                                                         */
/* Copyright (c) Nuvoton Technology Corp. All rights reserved.                                             */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/


/*---------------------------------------------------------------------------------------------------------*/
/* Include related headers                                                                                 */
/*---------------------------------------------------------------------------------------------------------*/
#include "NUC100.h"
#include "core_cm0.h"
#include "Driver/DrvSPI.h"
#include "Driver/DrvSYS.h"

/*---------------------------------------------------------------------------------------------------------*/
/* Global file scope (static) variables                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
typedef struct
{
    BOOL bBusy;
    PFN_DRVSPI_CALLBACK pfncallback;
    uint32_t u32userData;
} S_DRVSPI_HANDLE;

static S_DRVSPI_HANDLE g_sSpiHandler[4];

static SPI_T * SPI_PORT[4]={SPI0, SPI1, SPI2, SPI3};

/*---------------------------------------------------------------------------------------------------------*/
/* Interrupt Handler                                                                                       */
/*---------------------------------------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------------------------------------*/
/* Function: SPI0_IRQHandler                                                                               */
/*                                                                                                         */
/* Parameters:        	                                                                                   */
/*    None.                                                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    SPI0 interrupt handler.                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
void SPI0_IRQHandler(void)
{
	// write '1' to clear SPI0 interrupt flag
	SPI0->CNTRL.IF = 1;
	
	if(g_sSpiHandler[0].pfncallback != NULL)
	{
	g_sSpiHandler[0].pfncallback(g_sSpiHandler[0].u32userData);
	}
	
}

/*-----------------------------------------------------------------------------------------------------------*/
/* Function: SPI1_IRQHandler                                                                                 */
/*                                                                                                           */
/* Parameters:        	                                                                                     */
/*    None.                                                                                                  */
/*                                                                                                           */
/* Returns:                                                                                                  */
/*    None.                                                                                                  */
/*                                                                                                           */
/* Description:                                                                                              */
/*    SPI1 interrupt handler.                                                                                */
/*-----------------------------------------------------------------------------------------------------------*/
void SPI1_IRQHandler(void)
{
	// write '1' to clear SPI1 interrupt flag
	SPI1->CNTRL.IF = 1;
	
	if(g_sSpiHandler[1].pfncallback != NULL)
	{
		g_sSpiHandler[1].pfncallback(g_sSpiHandler[1].u32userData);
	}
}

/*-----------------------------------------------------------------------------------------------------------*/
/* Function: SPI2_IRQHandler                                                                                 */
/*                                                                                                           */
/* Parameters:        	                                                                                     */
/*    None.                                                                                                  */
/*                                                                                                           */
/* Returns:                                                                                                  */
/*    None.                                                                                                  */
/*                                                                                                           */
/* Description:                                                                                              */
/*    SPI2 interrupt handler.                                                                                */
/*-----------------------------------------------------------------------------------------------------------*/
void SPI2_IRQHandler(void)
{
	// write '1' to clear SPI2 interrupt flag
	SPI2->CNTRL.IF = 1;
	
	if(g_sSpiHandler[2].pfncallback != NULL)
	{
		g_sSpiHandler[2].pfncallback(g_sSpiHandler[2].u32userData);
	}
}

