DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvSPI.c
    Tx    --| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |------
          
    Rx    --| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |------


DRVSPI_TYPE7:
             _________________________________
    CS    __|                                 |____
           ___   _   _   _   _   _   _   _   ______ 
    CLK       |_| |_| |_| |_| |_| |_| |_| |_|  
              
    Tx    ----| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |----
          
    Rx    --| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |----


Master / Slave Transfer Type Matching Table

    DRVSPI_TYPE0 <==> DRVSPI_TYPE3
    DRVSPI_TYPE1 <==> DRVSPI_TYPE1
    DRVSPI_TYPE2 <==> DRVSPI_TYPE2
    DRVSPI_TYPE3 <==> DRVSPI_TYPE0
    DRVSPI_TYPE4 <==> DRVSPI_TYPE7
    DRVSPI_TYPE5 <==> DRVSPI_TYPE5
    DRVSPI_TYPE6 <==> DRVSPI_TYPE6
    DRVSPI_TYPE7 <==> DRVSPI_TYPE4
*/
/*--------------------------------------------------------------------------------------------------------------*/
ERRCODE DrvSPI_Open(E_DRVSPI_PORT eSpiPort, E_DRVSPI_MODE eMode, E_DRVSPI_TRANS_TYPE eType, int32_t i32BitLength)
{
	int32_t i32TimeOut;

	if(eSpiPort == SPI_PORT0)
	{
		SYSCLK->APBCLK.SPI0_EN  =1;
		SYS->IPRSTC2.SPI0_RST   =1;
		SYS->IPRSTC2.SPI0_RST   =0;
		SYS->GPCMFP.SPI0_SS0 	=1;
		SYS->GPCMFP.SPI0_CLK 	=1;
		SYS->GPCMFP.SPI0_MISO0 	=1;
		SYS->GPCMFP.SPI0_MOSI0 	=1;
		SYS->USPIMFP.SPI0_SS1    =1;
	}
	else if(eSpiPort == SPI_PORT1)
	{
		SYSCLK->APBCLK.SPI1_EN  =1;
		SYS->IPRSTC2.SPI1_RST   =1;
		SYS->IPRSTC2.SPI1_RST   =0;
		SYS->GPCMFP.SPI1_SS0 	=1;
		SYS->GPCMFP.SPI1_CLK 	=1;
		SYS->GPCMFP.SPI1_MISO0	=1;
		SYS->GPCMFP.SPI1_MOSI0 	=1;
		SYS->USPIMFP.SPI1_SS1    =1;
	}
	else if(eSpiPort == SPI_PORT2)
	{
		SYSCLK->APBCLK.SPI2_EN  =1;
		SYS->IPRSTC2.SPI2_RST   =1;
		SYS->IPRSTC2.SPI2_RST   =0;
		SYS->GPDMFP.SPI2_SS0 	=1;
		SYS->GPDMFP.SPI2_CLK 	=1;
		SYS->GPDMFP.SPI2_MISO0 	=1;
		SYS->GPDMFP.SPI2_MOSI0 	=1;
		SYS->USPIMFP.SPI2_SS1    =1;
	}
	else
	{
		SYSCLK->APBCLK.SPI3_EN  =1;
		SYS->IPRSTC2.SPI3_RST   =1;
		SYS->IPRSTC2.SPI3_RST   =0;
		SYS->GPDMFP.SPI3_SS0 	=1;
		SYS->GPDMFP.SPI3_CLK 	=1;
		SYS->GPDMFP.SPI3_MISO0 	=1;
		SYS->GPDMFP.SPI3_MOSI0 	=1;
		SYS->USPIMFP.SPI3_SS1    =1;
	}
	
	if(g_sSpiHandler[eSpiPort].bBusy)
	{
		return E_DRVSPI_ERR_INIT;
	}
	
	/* Check busy*/
	i32TimeOut = 0x10000;
	while(SPI_PORT[eSpiPort]->CNTRL.GO_BUSY == 1)
	{
		if(i32TimeOut-- <= 0)
			return E_DRVSPI_ERR_BUSY;
	}
	
	g_sSpiHandler[eSpiPort].bBusy = TRUE;
	g_sSpiHandler[eSpiPort].pfncallback = NULL;
	g_sSpiHandler[eSpiPort].u32userData = 0;
	
	if(eMode != eDRVSPI_JOYSTICK)
	{
	    /* Bit length 1 ~ 32 */
	    if((i32BitLength <= 0) || (i32BitLength > 32))
	    {
	        return E_DRVSPI_ERR_BIT_LENGTH;
	    }
    }
   
	if(eMode != eDRVSPI_JOYSTICK)
	{
		/* "i32BitLength = 0" means 32 bits */
		if(i32BitLength == 32)
		{
			i32BitLength = 0;
		}
		SPI_PORT[eSpiPort]->CNTRL.TX_BIT_LEN = i32BitLength;
	}
	
	if(eMode == eDRVSPI_JOYSTICK)
	{
		SPI_PORT[eSpiPort]->JS.READYB = 1;
		SPI_PORT[eSpiPort]->JS.JS = 1;
		SPI_PORT[eSpiPort]->SSR.SSR = 0;
		SPI_PORT[eSpiPort]->SSR.SS_LVL = 0;
		SPI_PORT[eSpiPort]->SSR.ASS = 0;
		SPI_PORT[eSpiPort]->SSR.SS_LTRIG = 0;
		SPI_PORT[eSpiPort]->TX[0] = 0;
		SPI_PORT[eSpiPort]->TX[1] = 0;
		SPI_PORT[eSpiPort]->CNTRL.TX_NEG = 1;
		SPI_PORT[eSpiPort]->CNTRL.CLKP = 1;
		SPI_PORT[eSpiPort]->CNTRL.SLAVE = 1;
		SPI_PORT[eSpiPort]->CNTRL.IE = 1;
	}
	else
	{
		SPI_PORT[eSpiPort]->JS.JS = 0;
		if(eMode == eDRVSPI_SLAVE)
			SPI_PORT[eSpiPort]->CNTRL.SLAVE = 1;
	
		/* Default to automatic slave select and it is low active */
		SPI_PORT[eSpiPort]->SSR.ASS = 1;
		
		/* Transition types */
		if(eType==eDRVSPI_TYPE0)
		{
			SPI_PORT[eSpiPort]->CNTRL.CLKP = 0;
			SPI_PORT[eSpiPort]->CNTRL.TX_NEG = 0;
			SPI_PORT[eSpiPort]->CNTRL.RX_NEG = 0;
		}
		else if(eType==eDRVSPI_TYPE1)
		{
			SPI_PORT[eSpiPort]->CNTRL.CLKP = 0;
			SPI_PORT[eSpiPort]->CNTRL.TX_NEG = 1;
			SPI_PORT[eSpiPort]->CNTRL.RX_NEG = 0;
		}
		else if(eType==eDRVSPI_TYPE2)
		{
			SPI_PORT[eSpiPort]->CNTRL.CLKP = 0;
			SPI_PORT[eSpiPort]->CNTRL.TX_NEG = 0;
			SPI_PORT[eSpiPort]->CNTRL.RX_NEG = 1;
		}
		else if(eType==eDRVSPI_TYPE3)
		{
			SPI_PORT[eSpiPort]->CNTRL.CLKP = 0;
			SPI_PORT[eSpiPort]->CNTRL.TX_NEG = 1;
			SPI_PORT[eSpiPort]->CNTRL.RX_NEG = 1;
		}
		else if(eType==eDRVSPI_TYPE4)
		{
			SPI_PORT[eSpiPort]->CNTRL.CLKP = 1;
			SPI_PORT[eSpiPort]->CNTRL.TX_NEG = 0;
			SPI_PORT[eSpiPort]->CNTRL.RX_NEG = 0;
		}
		else if(eType==eDRVSPI_TYPE5)
		{
			SPI_PORT[eSpiPort]->CNTRL.CLKP = 1;
			SPI_PORT[eSpiPort]->CNTRL.TX_NEG = 1;
			SPI_PORT[eSpiPort]->CNTRL.RX_NEG = 0;
		}
		else if(eType==eDRVSPI_TYPE6)
		{
			SPI_PORT[eSpiPort]->CNTRL.CLKP = 1;
			SPI_PORT[eSpiPort]->CNTRL.TX_NEG = 0;
			SPI_PORT[eSpiPort]->CNTRL.RX_NEG = 1;
		}
		else
		{
			SPI_PORT[eSpiPort]->CNTRL.CLKP = 1;
			SPI_PORT[eSpiPort]->CNTRL.TX_NEG = 1;
			SPI_PORT[eSpiPort]->CNTRL.RX_NEG = 1;
		}
		
    }

    return E_SUCCESS;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_Close                                                                                  */
/*                                                                                                         */
/* Parameters:        	                                                                                   */
/*    eSpiPort [in]:  Specify the SPI port.                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Close the specified SPI module and disable the SPI interrupt.                                        */
/*---------------------------------------------------------------------------------------------------------*/
void DrvSPI_Close(E_DRVSPI_PORT eSpiPort)
{
	int32_t i32TimeOut;
	
	g_sSpiHandler[eSpiPort].bBusy = FALSE;
	g_sSpiHandler[eSpiPort].pfncallback = NULL;
	g_sSpiHandler[eSpiPort].u32userData = 0;

	/* Wait SPIMS Busy */
	i32TimeOut = 0x10000;
	while(SPI_PORT[eSpiPort]->CNTRL.GO_BUSY == 1)
	{
		if(i32TimeOut-- <= 0)
			break;
	}
   
   if(eSpiPort == SPI_PORT0)
	{
		NVIC_DisableIRQ(SPI0_IRQn);
		SYS->IPRSTC2.SPI0_RST=1;
		SYS->IPRSTC2.SPI0_RST=0;
		SYSCLK->APBCLK.SPI0_EN=0;
	}
	else if(eSpiPort == SPI_PORT1)
	{
		NVIC_DisableIRQ(SPI1_IRQn);
		SYS->IPRSTC2.SPI1_RST=1;
		SYS->IPRSTC2.SPI1_RST=0;
		SYSCLK->APBCLK.SPI1_EN=0;
	}
	else if(eSpiPort == SPI_PORT2)
	{
		NVIC_DisableIRQ(SPI2_IRQn);
		SYS->IPRSTC2.SPI2_RST=1;
		SYS->IPRSTC2.SPI2_RST=0;
		SYSCLK->APBCLK.SPI2_EN=0;
	}
	else
	{
		NVIC_DisableIRQ(SPI3_IRQn);
		SYS->IPRSTC2.SPI3_RST=1;
		SYS->IPRSTC2.SPI3_RST=0;
		SYSCLK->APBCLK.SPI3_EN=0;
	}
   
