DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvSPI.c
}

/*--------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_Set2BitSerialDataIOMode                                                                           */
/*                                                                                                                    */
/* Parameters:        	                                                                                              */
/*    eSpiPort [in]: Specify the SPI port                                                                             */
/*    bEnable  [in]: Enable (TRUE) / Disable (FALSE)                                                                  */
/*                                                                                                                    */
/* Returns:                                                                                                           */
/*    None.                                                                                                           */
/*                                                                                                                    */
/* Description:                                                                                                       */
/*    Set 2-bit serial data I/O mode.                                                                                 */
/*    When enable 2-bit serial data I/O mode, the Tx_NUM must be configure as 0x00 (one transaction in one transfer.) */
/*--------------------------------------------------------------------------------------------------------------------*/
void DrvSPI_Set2BitSerialDataIOMode(E_DRVSPI_PORT eSpiPort, BOOL bEnable)
{
	if(bEnable)
	{
		SPI_PORT[eSpiPort]->CNTRL.TWOB = 1;
		SPI_PORT[eSpiPort]->CNTRL.TX_NUM = 0;
		if(eSpiPort == SPI_PORT0)
		{
			SYS->GPCMFP.SPI0_MISO1 	=1;
			SYS->GPCMFP.SPI0_MOSI1 	=1;
		}
		else if(eSpiPort == SPI_PORT1)
		{
			SYS->GPCMFP.SPI1_MISO1 	=1;
			SYS->GPCMFP.SPI1_MOSI1 	=1;
		}
		else if(eSpiPort == SPI_PORT2)
		{
			SYS->GPDMFP.SPI2_MISO1 	=1;
			SYS->GPDMFP.SPI2_MOSI1 	=1;
		}
		else
		{
			SYS->GPDMFP.SPI3_MISO1 	=1;
			SYS->GPDMFP.SPI3_MOSI1 	=1;
		}
	}
	else
		SPI_PORT[eSpiPort]->CNTRL.TWOB = 0;
}

/*------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetEndian                                                                                       */
/*                                                                                                                  */
/* Parameters:        	                                                                                            */
/*    eSpiPort [in]: Specify the SPI port                                                                           */
/*    eEndian  [in]: Specify LSB first or MSB first                                                                 */
/*                                                                                                                  */
/* Returns:                                                                                                         */
/*    None.                                                                                                         */
/*                                                                                                                  */
/* Description:                                                                                                     */
/*    Dertermine to transfer data with LSB first or MSB first                                                       */
/*------------------------------------------------------------------------------------------------------------------*/
void DrvSPI_SetEndian(E_DRVSPI_PORT eSpiPort, E_DRVSPI_ENDIAN eEndian)
{

	if(eEndian == eDRVSPI_LSB_FIRST)
	{
		SPI_PORT[eSpiPort]->CNTRL.LSB = 1;
	}
	else
		SPI_PORT[eSpiPort]->CNTRL.LSB = 0;

}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetBitLength                                                                           */
/*                                                                                                         */
/* Parameters:        	                                                                                   */
/*    eSpiPort     [in]: Specify the SPI port                                                              */
/*    i32BitLength [in]: Specify the bit length (1~32 bits)                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    E_SUCCESS:                 Success.                                                                  */
/*    E_DRVSPI_ERR_BIT_LENGTH: The bit length is out of range.                                             */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Set the bit length of SPI transfer.                                                                  */
/*---------------------------------------------------------------------------------------------------------*/
ERRCODE DrvSPI_SetBitLength(E_DRVSPI_PORT eSpiPort, int32_t i32BitLength)
{

    if((i32BitLength < 1) || (i32BitLength > 32))
    {
        return E_DRVSPI_ERR_BIT_LENGTH;
    }
    if(i32BitLength == 32)
        i32BitLength = 0;

	SPI_PORT[eSpiPort]->CNTRL.TX_BIT_LEN = i32BitLength;
	
    return E_SUCCESS;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetByteSleep                                                                           */
/*                                                                                                         */
/* Parameters:        	                                                                                   */
/*    eSpiPort     [in]: Specify the SPI port                                                              */
/*    bEnable      [in]: Enable (TRUE) / Disable (FALSE)                                                   */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    E_SUCCESS:                 Success.                                                                  */
/*    E_DRVSPI_ERR_BIT_LENGTH: The bit length is not 32 bits.                                              */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Enable/disable Byte Sleep function.                                                                  */
/*    The Byte Sleep function is supported only in word (32 bits) transaction mode.                        */
/*---------------------------------------------------------------------------------------------------------*/
ERRCODE DrvSPI_SetByteSleep(E_DRVSPI_PORT eSpiPort, BOOL bEnable)
{
	
	if(SPI_PORT[eSpiPort]->CNTRL.TX_BIT_LEN != 0)
		return E_DRVSPI_ERR_BIT_LENGTH;

