DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvSPI.c
/*----------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_EnableAutoCS                                                                            */
/*                                                                                                          */
/* Parameters:        	                                                                                    */
/*    eSpiPort   [in]: Specify the SPI port                                                                 */
/*    eSlaveSel  [in]: Select the slave select pins which will be used.                                     */
/*                                                                                                          */
/* Returns:                                                                                                 */
/*    None.                                                                                                 */
/*                                                                                                          */
/* Description:                                                                                             */
/*    Enable the automatic slave select function and set the specified slave select pin.                    */
/*----------------------------------------------------------------------------------------------------------*/
void DrvSPI_EnableAutoCS(E_DRVSPI_PORT eSpiPort, E_DRVSPI_SLAVE_SEL eSlaveSel)
{
    SPI_PORT[eSpiPort]->SSR.ASS = 1;
    SPI_PORT[eSpiPort]->SSR.SSR = eSlaveSel;
}

/*----------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_DisableAutoCS                                                                           */
/*                                                                                                          */
/* Parameters:        	                                                                                    */
/*    eSpiPort   [in]: Specify the SPI port                                                                 */
/*                                                                                                          */
/* Returns:                                                                                                 */
/*    None.                                                                                                 */
/*                                                                                                          */
/* Description:                                                                                             */
/*    Disable the Automatic Slave Slect function and deselect slave select pins.                            */
/*----------------------------------------------------------------------------------------------------------*/
void DrvSPI_DisableAutoCS(E_DRVSPI_PORT eSpiPort)
{
    SPI_PORT[eSpiPort]->SSR.ASS = 0;
    SPI_PORT[eSpiPort]->SSR.SSR = eDRVSPI_NONE;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetCS                                                                                            */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*   eSpiPort   [in]: Specify the SPI port                                                                           */
/*   eSlaveSel  [in]: In automatic slave select operation, to use this parameter to select the slave select pins     */
/*                    which will be used.                                                                            */
/*                    In manual slave select operation, the specified slave select pins will be set to active state. */
/*                    It could be eDRVSPI_NONE, eDRVSPI_SS0, eDRVSPI_SS1 or eDRVSPI_SS0_SS1.                         */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    None.                                                                                                          */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Configure the slave select pins.                                                                               */
/*-------------------------------------------------------------------------------------------------------------------*/
void DrvSPI_SetCS(E_DRVSPI_PORT eSpiPort, E_DRVSPI_SLAVE_SEL eSlaveSel)
{
    SPI_PORT[eSpiPort]->SSR.SSR = eSlaveSel;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_ClrCS                                                                                            */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort  [in]: Specify the SPI port                                                                           */
/*    eSlaveSel [in]: Specify slave select pins                                                                      */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    None.                                                                                                          */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Set the specified slave select pins to inactive state.                                                         */
/*-------------------------------------------------------------------------------------------------------------------*/
void DrvSPI_ClrCS(E_DRVSPI_PORT eSpiPort, E_DRVSPI_SLAVE_SEL eSlaveSel)
{
	uint32_t u32Reg;
	
	u32Reg = SPI_PORT[eSpiPort]->SSR.SSR;
	u32Reg = u32Reg & (~eSlaveSel);
	SPI_PORT[eSpiPort]->SSR.SSR = u32Reg;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_Busy                                                                                             */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort   [in]: Specify the SPI port                                                                          */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    TRUE:  The SPI port is in busy.                                                                                */
/*    FALSE: The SPI port is not in busy.                                                                            */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Check the busy status of the specified SPI port.                                                               */
/*-------------------------------------------------------------------------------------------------------------------*/
BOOL DrvSPI_Busy(E_DRVSPI_PORT eSpiPort)
{
    return ((SPI_PORT[eSpiPort]->CNTRL.GO_BUSY)?TRUE:FALSE);
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_BurstTransfer                                                                                    */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort    [in]: Specify the SPI port                                                                         */
/*    i32BurstCnt [in]: Specify the transaction number in one transfer. It could be 1 or 2.                          */
/*    i32Interval [in]: Specify the delay clocks between successive transactions. It could be 2~17.                  */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    E_DRVSPI_ERR_BURST_CNT: The transaction number is out of range.                                                */
/*    E_DRVSPI_ERR_TRANSMIT_INTERVAL: The suspend interval setting is out of range.                                  */
/*    E_SUCCESS: Success.                                                                                            */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Configure the burst transfer settings.                                                                         */
/*-------------------------------------------------------------------------------------------------------------------*/
ERRCODE DrvSPI_BurstTransfer(E_DRVSPI_PORT eSpiPort, int32_t i32BurstCnt, int32_t i32Interval)
{

	if((i32BurstCnt < 1) || (i32BurstCnt > 2))
	{
		return E_DRVSPI_ERR_BURST_CNT;
	}
	
