DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvSPI.c
	if((i32Interval < 2) || (i32Interval > 17))
	{
		return E_DRVSPI_ERR_TRANSMIT_INTERVAL;
	}

	SPI_PORT[eSpiPort]->CNTRL.TX_NUM = i32BurstCnt-1;
	SPI_PORT[eSpiPort]->CNTRL.SLEEP = i32Interval-2;

	return E_SUCCESS;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetClock                                                                                         */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort  [in]: Specify the SPI port                                                                           */
/*    u32Clock1 [in]: Specify the SPI clock rate in Hz. It's the clock rate of SPI base clock or variable clock 1.   */
/*    u32Clock2 [in]: Specify the SPI clock rate in Hz. It's the clock rate of variable clock 2.                     */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    The actual value of divisor 1 is returned. SPI engine clock rate: APB clock rate / ((divisor 1 + 1) * 2)       */
/*    The actual clock may be different to the target SPI clock due to hardware limitation.                          */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Configure the SPI clock.                                                                                       */
/*-------------------------------------------------------------------------------------------------------------------*/
uint32_t DrvSPI_SetClock(E_DRVSPI_PORT eSpiPort, uint32_t u32Clock1, uint32_t u32Clock2)
{
    uint32_t u32Div;
    uint32_t u32Pclk;
    
    u32Pclk = DrvSYS_GetHCLK();
    
	if(u32Clock2!=0)
	{
		u32Div = (((u32Pclk / u32Clock2) + 1) >> 1) - 1;
		if(u32Div > 65535)
		    u32Div = 65535;
		if(u32Div < 1)
		    u32Div = 1;
		SPI_PORT[eSpiPort]->DIVIDER.DIVIDER2 = u32Div;
	}
	
	if(u32Clock1!=0)
	{
		u32Div = (((u32Pclk / u32Clock1) + 1) >> 1) - 1;
		if(u32Div > 65535)
		    u32Div = 65535;
		if(u32Div < 1)
		    u32Div = 1;
		SPI_PORT[eSpiPort]->DIVIDER.DIVIDER = u32Div;
		u32Div = u32Pclk / u32Div;
		return u32Div;
	}
	else
		return 0;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_GetClock1                                                                                        */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort   [in]: Specify the SPI port                                                                          */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    The current SPI bus clock frequency in Hz.                                                                     */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Get the SPI engine clock rate in Hz.                                                                           */
/*-------------------------------------------------------------------------------------------------------------------*/
uint32_t DrvSPI_GetClock1(E_DRVSPI_PORT eSpiPort)
{
	uint32_t u32Div;
	uint32_t u32ApbClock;

	u32ApbClock = DrvSYS_GetHCLK();
	u32Div = SPI_PORT[eSpiPort]->DIVIDER.DIVIDER;
	return ((u32ApbClock >> 1) / (u32Div + 1));   /* SPI_CLK = APB_CLK / ((Divider + 1) * 2) */
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_GetClock2                                                                                        */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort   [in]: Specify the SPI port                                                                          */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    The frequency of variable clock 2 in Hz.                                                                       */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Get the clock rate of variable clock 2 in Hz.                                                                  */
/*-------------------------------------------------------------------------------------------------------------------*/
uint32_t DrvSPI_GetClock2(E_DRVSPI_PORT eSpiPort)
{
	uint32_t u32Div;
	uint32_t u32ApbClock;

	u32ApbClock = DrvSYS_GetHCLK();
	u32Div = SPI_PORT[eSpiPort]->DIVIDER.DIVIDER2;
	return ((u32ApbClock >> 1) / (u32Div + 1));   /* SPI_CLK = APB_CLK / ((Divider + 1) * 2) */
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetVariableClockPattern                                                                          */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort   [in]: Specify the SPI port                                                                          */
/*    u32Pattern [in]: Specify the variable clock pattern                                                            */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    None.                                                                                                          */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    If the bit pattern of VARCLK is ．0・, the output frequency of SPICLK is according to the value of DIVIDER.      */
/*    If the bit pattern of VARCLK is ．1・, the output frequency of SPICLK is according to the value of DIVIDER2.     */
/*-------------------------------------------------------------------------------------------------------------------*/
void DrvSPI_SetVariableClockPattern(E_DRVSPI_PORT eSpiPort, uint32_t u32Pattern)
{
	SPI_PORT[eSpiPort]->VARCLK = u32Pattern;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetVariableClockFunction                                                                         */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort   [in]: Specify the SPI port                                                                          */
/*    bEnable    [in]: TRUE -- Enable variable clock;                                                                */
/*                     FALSE -- Disable variable clock.                                                              */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    None.                                                                                                          */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Set the variable clock function.                                                                               */
/*-------------------------------------------------------------------------------------------------------------------*/
void DrvSPI_SetVariableClockFunction(E_DRVSPI_PORT eSpiPort, BOOL bEnable)
{
	if(bEnable)
		SPI_PORT[eSpiPort]->CNTRL.VARCLK_EN = 1;
	else
		SPI_PORT[eSpiPort]->CNTRL.VARCLK_EN = 0;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_EnableInt                                                                                        */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort    [in]: Specify the SPI port                                                                         */
/*    pfnCallback [in]: The callback function of SPI interrupt.                                                      */
/*    u32UserData [in]: The parameter which will be passed to the callback function.                                 */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    None.                                                                                                          */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Enable the SPI interrupt of the specified SPI port and install the callback function.                          */
/*-------------------------------------------------------------------------------------------------------------------*/
void DrvSPI_EnableInt(E_DRVSPI_PORT eSpiPort, PFN_DRVSPI_CALLBACK pfnCallback, uint32_t u32UserData)
{
	
	if(pfnCallback != NULL)
	{
		g_sSpiHandler[eSpiPort].pfncallback = pfnCallback;
		g_sSpiHandler[eSpiPort].u32userData = u32UserData;
	}
	
	SPI_PORT[eSpiPort]->CNTRL.IE = 1;
	
	if(eSpiPort == SPI_PORT0)
	{
	    NVIC_EnableIRQ(SPI0_IRQn);
	}
	else if(eSpiPort == SPI_PORT1)
	{
	    NVIC_EnableIRQ(SPI1_IRQn);
	}
	else if(eSpiPort == SPI_PORT2)
	{
	    NVIC_EnableIRQ(SPI2_IRQn);
	}
	else
	{
	    NVIC_EnableIRQ(SPI3_IRQn);
	}
}	

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_DisableInt                                                                                       */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort   [in]: Specify the SPI port                                                                          */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    None.                                                                                                          */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Disable the SPI interrupt.                                                                                     */
/*-------------------------------------------------------------------------------------------------------------------*/
void DrvSPI_DisableInt(E_DRVSPI_PORT eSpiPort)
{
	g_sSpiHandler[eSpiPort].pfncallback = NULL;
	g_sSpiHandler[eSpiPort].u32userData = 0;
	
	SPI_PORT[eSpiPort]->CNTRL.IE = 0;

	if(eSpiPort == SPI_PORT0)
	{
	    NVIC_DisableIRQ(SPI0_IRQn);
	}
	else if(eSpiPort == SPI_PORT1)
	{
	    NVIC_DisableIRQ(SPI1_IRQn);
	}
	else if(eSpiPort == SPI_PORT2)
	{
	    NVIC_DisableIRQ(SPI2_IRQn);
	}
	else
	{
	    NVIC_DisableIRQ(SPI3_IRQn);
	}
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SingleRead                                                                                       */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort   [in]:  Specify the SPI port                                                                         */
/*    pu32Data   [out]: Store the data got from the SPI bus.                                                         */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    TRUE:  The data stored in pu32Data is valid.                                                                   */
/*    FALSE: The data stored in pu32Data is invalid.                                                                 */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Read data from SPI Rx registers and trigger SPI for next transfer.                                             */
/*-------------------------------------------------------------------------------------------------------------------*/
BOOL DrvSPI_SingleRead(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Data)
{
	if(SPI_PORT[eSpiPort]->CNTRL.GO_BUSY==1)
		return FALSE;

	*pu32Data = SPI_PORT[eSpiPort]->RX[0];
	SPI_PORT[eSpiPort]->CNTRL.GO_BUSY = 1;
	return TRUE;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SingleWrite                                                                                      */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort  [in]:  Specify the SPI port                                                                          */
/*    pu32Data  [in]:  Store the data which will be transmitted through the SPI bus.                                 */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    TRUE:  The data stored in pu32Data has been transferred.                                                       */
/*    FALSE: The SPI is in busy. The data stored in pu32Data has not been transferred.                               */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Write data to SPI bus and trigger SPI to start transfer.                                                       */
/*-------------------------------------------------------------------------------------------------------------------*/
BOOL DrvSPI_SingleWrite(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Data)
{
	if(SPI_PORT[eSpiPort]->CNTRL.GO_BUSY==1)
		return FALSE;

	SPI_PORT[eSpiPort]->TX[0] = *pu32Data;
	SPI_PORT[eSpiPort]->CNTRL.GO_BUSY = 1;
	return TRUE;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_BurstRead                                                                                        */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort  [in]:  Specify the SPI port                                                                          */
/*    pu32Buf   [out]: Store the data got from the SPI bus.                                                          */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    TRUE: The data stored in pu32Buf is valid.                                                                     */
/*    FALSE: The data stored in pu32Buf is invalid.                                                                  */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Read two words of data from SPI Rx registers and then trigger SPI for next transfer.                           */
/*-------------------------------------------------------------------------------------------------------------------*/
BOOL DrvSPI_BurstRead(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Buf)
{
	if(SPI_PORT[eSpiPort]->CNTRL.GO_BUSY==1)
		return FALSE;

