DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvSPI.c
	pu32Buf[0] = SPI_PORT[eSpiPort]->RX[0];
	pu32Buf[1] = SPI_PORT[eSpiPort]->RX[1];
	SPI_PORT[eSpiPort]->CNTRL.GO_BUSY = 1;

	return TRUE;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_BurstWrite                                                                                       */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort  [in]:  Specify the SPI port                                                                          */
/*    pu32Buf   [in]:  Store the data which will be transmitted through the SPI bus.                                 */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    TRUE: The data stored in pu32Buf has been transferred.                                                         */
/*    FALSE: The SPI is in busy. The data stored in pu32Buf has not been transferred.                                */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Write two words of data to SPI bus and then trigger SPI to start transfer.                                     */
/*-------------------------------------------------------------------------------------------------------------------*/
BOOL DrvSPI_BurstWrite(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Buf)
{
	if(SPI_PORT[eSpiPort]->CNTRL.GO_BUSY==1)
		return FALSE;

	SPI_PORT[eSpiPort]->TX[0] = pu32Buf[0];
	SPI_PORT[eSpiPort]->TX[1] = pu32Buf[1];
	SPI_PORT[eSpiPort]->CNTRL.GO_BUSY = 1;

	return TRUE;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_DumpRxRegister                                                                                   */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort     [in]:  Specify the SPI port                                                                       */
/*    pu32Buf      [out]: Store the data got from Rx registers.                                                      */
/*    u32DataCount [in]:  The count of data read from Rx registers.                                                  */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    The count of data actually read from Rx registers.                                                             */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Read data from Rx registers. This function will not trigger another data transfer.                             */
/*-------------------------------------------------------------------------------------------------------------------*/
uint32_t DrvSPI_DumpRxRegister(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Buf, uint32_t u32DataCount)
{
	uint32_t i;
	
	if(u32DataCount>2)
		u32DataCount = 2;
	
	for(i=0; i<u32DataCount; i++)
	{
		pu32Buf[i] = SPI_PORT[eSpiPort]->RX[i];
	}

    return u32DataCount;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetTxRegister                                                                                    */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort     [in]:  Specify the SPI port                                                                       */
/*    pu32Buf      [in]:  Store the data which will be written to Tx registers.                                      */
/*    u32DataCount [in]:  The count of data write to Tx registers.                                                   */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    The count of data actually written to Tx registers.                                                            */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Write data to Tx registers. This function will not trigger another data transfer.                              */
/*-------------------------------------------------------------------------------------------------------------------*/
uint32_t DrvSPI_SetTxRegister(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Buf, uint32_t u32DataCount)
{
	uint32_t i;

	if(u32DataCount>2)
		u32DataCount = 2;
	
	for(i=0; i<u32DataCount; i++)
	{
		SPI_PORT[eSpiPort]->TX[i] = pu32Buf[i];
	}

    return u32DataCount;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetGo                                                                                            */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort     [in]:  Specify the SPI port                                                                       */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    None.                                                                                                          */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Set the GO_BUSY bit to trigger a SPI data trasfer.                                                             */
/*-------------------------------------------------------------------------------------------------------------------*/
void DrvSPI_SetGo(E_DRVSPI_PORT eSpiPort)
{
	SPI_PORT[eSpiPort]->CNTRL.GO_BUSY = 1;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_GetJoyStickIntType                                                                               */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort     [in]:  Specify the SPI port                                                                       */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    eDRVSPI_JOYSTICK_DATA_READY: 8-byte data available in the buffer.                                              */
/*    eDRVSPI_JOYSTICK_CS_ACTIVE:  Chip Select is actived.                                                           */
/*    eDRVSPI_JOYSTICK_CS_DEACT:   Chip Select is de-actived.                                                        */
/*    eDRVSPI_JOYSTICK_NONE:       None.                                                                             */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Get interrupt flag of JOYSTICK mode.                                                                           */
/*-------------------------------------------------------------------------------------------------------------------*/
E_DRVSPI_JOYSTICK_INT_FLAG DrvSPI_GetJoyStickIntType(E_DRVSPI_PORT eSpiPort)
{
	if(SPI_PORT[eSpiPort]->JS.DATA_RDY == 1)
		return eDRVSPI_JOYSTICK_DATA_READY;
	
	if(SPI_PORT[eSpiPort]->JS.CS_ACT == 1)
		return eDRVSPI_JOYSTICK_CS_ACTIVE;
	
	if(SPI_PORT[eSpiPort]->JS.CS_DEACT == 1)
		return eDRVSPI_JOYSTICK_CS_DEACT;
	
	return eDRVSPI_JOYSTICK_NONE;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetJoyStickStatus                                                                                */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort     [in]: Specify the SPI port                                                                        */
/*    bReady       [in]: TRUE  -- The SPI is ready to transfer data.                                                 */
/*                       FALSE -- The SPI is not ready to transfer data.                                             */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    None.                                                                                                          */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Set the JoyStick status to ready or not ready.                                                                 */
/*-------------------------------------------------------------------------------------------------------------------*/
void DrvSPI_SetJoyStickStatus(E_DRVSPI_PORT eSpiPort, BOOL bReady)
{
	if(bReady)
		SPI_PORT[eSpiPort]->JS.READYB = 0;
	else
		SPI_PORT[eSpiPort]->JS.READYB = 1;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_GetJoyStickMode                                                                                  */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort     [in]:  Specify the SPI port                                                                       */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    eDRVSPI_JOYSTICK_TRANSMIT_MODE: Master writes data to slave.                                                   */
/*    eDRVSPI_JOYSTICK_RECEIVE_MODE:  Master read data from slave.                                                   */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Get the JoyStick operation mode.                                                                               */
/*-------------------------------------------------------------------------------------------------------------------*/
E_DRVSPI_JOYSTICK_RW_MODE DrvSPI_GetJoyStickMode(E_DRVSPI_PORT eSpiPort)
{
	if( (SPI_PORT[eSpiPort]->JS.JS_RW)==0 )
		return eDRVSPI_JOYSTICK_TRANSMIT_MODE;
	else
		return eDRVSPI_JOYSTICK_RECEIVE_MODE;
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_StartPDMA                                                                                        */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    eSpiPort     [in]: Specify the SPI port                                                                        */
/*    eDmaMode     [in]: Specify the DMA mode.                                                                       */
/*    bEnable      [in]: TRUE  -- Enable DMA;                                                                        */
/*                       FALSE -- Disable DMA.                                                                       */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    None.                                                                                                          */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Configure the DMA settings.                                                                                    */
/*-------------------------------------------------------------------------------------------------------------------*/
void DrvSPI_StartPDMA(E_DRVSPI_PORT eSpiPort, E_DRVSPI_DMA_MODE eDmaMode, BOOL bEnable)
{
	if(eDmaMode==eDRVSPI_TX_DMA)
	{
		if(bEnable)
			SPI_PORT[eSpiPort]->DMA.TX_DMA_GO = 1;
		else
			SPI_PORT[eSpiPort]->DMA.TX_DMA_GO = 0;
	}
	else
	{
		if(bEnable)
			SPI_PORT[eSpiPort]->DMA.RX_DMA_GO = 1;
		else
			SPI_PORT[eSpiPort]->DMA.RX_DMA_GO = 0;
	}
}

/*-------------------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_GetVersion                                                                                       */
/*                                                                                                                   */
/* Parameters:        	                                                                                             */
/*    None.                                                                                                          */
/*                                                                                                                   */
/* Returns:                                                                                                          */
/*    Version number.                                                                                                */
/*                                                                                                                   */
/* Description:                                                                                                      */
/*    Get the version number of NUC100 SPI driver.                                                                   */
/*-------------------------------------------------------------------------------------------------------------------*/
uint32_t DrvSPI_GetVersion(void)
{
	return DRVSPI_VERSION_NUM;
}
